cfg/DataProcessors/НастройкаПараметровУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>НастройкаПараметровУчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/InformationRegisters/УчетнаяПолитикаПоПерсоналуОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоПерсоналуОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоддержкаВнутреннегоСовместительства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиныйНумераторКадровыхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетЗарплатыОрганизацииПоОтветственным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьТабельныеНомераВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуютсяНачисленияВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНеВестиУчетПоТабельнымНомерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейПоложенногоОтпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковОтпусков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ПараметрыРасчетаЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРасчетаЗарплатыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентВечерних</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентНочных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтбрасыватьКопейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДо</Name>
					<Comment>Если 1, то отбрасывать копейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Comment>До этой даты документ НачислениеЗарплаты проводится</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПремии</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьГодоваяПремия</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии за год</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентРасчетаОтОбратного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВзносов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВзносовВФонды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСовместителейДляСредних</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьЛьготуНДФЛДляАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьЛьготуНДФЛДляБудущихПериодов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРезерваОтпусков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриУплатеЕСВОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьКоэффициентЕСВДляАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/УчетнаяПолитикаПоПерсоналу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоПерсоналу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасчетЗарплатыПоОтветственным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНеВестиУчетПоТабельнымНомерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьТабельныеНомераВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживатьНесколькоСхемМотивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/DataProcessors/НастройкаПараметровУчета/Ext/ObjectModule.bsl
#Если Клиент Тогда 
	
Процедура ПолучитьУчетнуюПолитикуПоПерсоналу(ФормаОбработки) 
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций, НаборЗаписей[0]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьУчетнуюПолитикуПоРасчетуЗарплаты(ФормаОбработки) 
	
	НаборЗаписей = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты, НаборЗаписей[0]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьДанныеУчетнаяПолитикаПоПерсоналу(ФормаОбработки) Экспорт

	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.УправленческийУчет.Видимость Тогда
		
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоПерсоналу.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоПерсоналу, НаборЗаписей[0]);
			ФормаОбработки.ПоддерживатьНесколькоСхемМотивации = ФормаОбработки.мУчетнаяПолитикаПоПерсоналу.ПоддерживатьНесколькоСхемМотивации;
			ФормаОбработки.РасчетЗарплатыПоОтветственным = ФормаОбработки.мУчетнаяПолитикаПоПерсоналу.РасчетЗарплатыПоОтветственным;
			ФормаОбработки.ПоказыватьТабельныеНомераВДокументахУпр = ФормаОбработки.мУчетнаяПолитикаПоПерсоналу.ПоказыватьТабельныеНомераВДокументах;
			
		КонецЕсли;
		
		ФормаОбработки.ЭлементыФормы.НадписьСписокРасчетчиковЗарплатыУпр.Видимость = ФормаОбработки.мУчетнаяПолитикаПоПерсоналу.РасчетЗарплатыПоОтветственным;
		
		ФормаОбработки.РежимНабораПерсонала = Константы.РежимНабораПерсонала.Получить();
		
	КонецЕсли;	

КонецПроцедуры


// Процедура получает по организации и заполняет реквизиты формы
Процедура ПолучитьДанныеПоОрганизации(ФормаОбработки) Экспорт
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.КадровыйУчет.Видимость Тогда
		ПолучитьУчетнуюПолитикуПоПерсоналу(ФормаОбработки);
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций);
		ФормаОбработки.ЭлементыФормы.НадписьСписокРасчетчиковЗарплаты.Видимость = ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций.РасчетЗарплатыОрганизацииПоОтветственным;
		ФормаОбработки.ЭлементыФормы.НадписьКурсыВалют.Видимость = ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций.ИспользуютсяНачисленияВВалюте;
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетЗарплаты.Видимость Тогда
		ПолучитьУчетнуюПолитикуПоРасчетуЗарплаты(ФормаОбработки);
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты);
	КонецЕсли;
	
КонецПроцедуры

// Функция записывает изменненые данные в регистры сведений
// УчетнаяПолитикаПоПерсоналуОрганизаций, УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций, УчетнаяПолитикаНалоговыйУчет
// УчетнаяПолитикаПоЕСН, СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев
Функция ЗаписатьДанныеПоОрганизации(ФормаОбработки) Экспорт

	НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации = Ложь;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.КадровыйУчет.Видимость Тогда
		
		НадоЗаписать = Ложь;
		
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций);
		НоваяЗапись.Организация = Организация;

		НаборЗаписейДляПроверки = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписейДляПроверки.Отбор.Организация.Установить(Организация);
		НаборЗаписейДляПроверки.Прочитать();
		НадоЗаписать = Не НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(НаборЗаписейДляПроверки.Выгрузить(), НаборЗаписей.Выгрузить());
				
		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
			НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетЗарплаты.Видимость Тогда
		
		НадоЗаписать = Ложь;
		
		НаборЗаписей = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты);
		НоваяЗапись.Организация = Организация;

		НаборЗаписейДляПроверки = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписейДляПроверки.Отбор.Организация.Установить(Организация);
		НаборЗаписейДляПроверки.Прочитать();
		НадоЗаписать = Не НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(НаборЗаписейДляПроверки.Выгрузить(), НаборЗаписей.Выгрузить());
				
		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
		КонецЕсли;

		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации Тогда
		глЗначениеПеременнойУстановить("глУчетнаяПолитикаПоПерсоналуОрганизации", ЗаполнениеУчетнойПолитикиПоПерсоналуОрганизации(), ИСТИНА);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ 

Процедура ФормаОбработкиПередОткрытием(ФормаОбработки, Отказ) Экспорт

	Если ЗначениеЗаполнено(Организация) Тогда
		// в форму передана организация
		// проверим доступ
		Отказ = Не ОбщегоНазначения.ЭтоДоступнаяОрганизация(Организация)
	Иначе
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		РаботаСДиалогами.СформироватьСтраницыФормы(ФормаОбработки.мСоответствиеОбъектыМетаданных, ФормаОбработки.мСоответствиеРеквизитыФормы);
		
		Отказ = Истина;
		Для каждого СтраницаФормы Из ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы Цикл
			Если СтраницаФормы.Видимость Тогда
				// на форме есть видимые страницы, можно открывать форму
				Если Отказ Тогда
					// это первая из видимых страниц, сделаем ее текущей
					ФормаОбработки.ЭлементыФормы.ПанельНастроек.ТекущаяСтраница = СтраницаФормы;
				КонецЕсли;
				Отказ = Ложь;
				
				МассивОбъектовМетаданных = ФормаОбработки.мСоответствиеОбъектыМетаданных[СтраницаФормы];
				Для каждого ОбъектМетаданных Из МассивОбъектовМетаданных Цикл
					Если Найти(ОбъектМетаданных.ПолноеИмя(), "Константа") <> 0 Тогда
//*						ФормаОбработки.мСтрокаКонстант = ФормаОбработки.мСтрокаКонстант + ОбъектМетаданных.Имя + ",";
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры

#КонецЕсли
